# VarSketchInElementFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..VarSketchInElementFailure Property
BuiltInFailures..::..SketchFailures Class See Also
---
The constraints of the sketch defining the highlighted element cannot be satisfied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId VarSketchInElementFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VarSketchInElementFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ VarSketchInElementFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace